&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
Соединение = Новый HTTPСоединение(
        "kaluga.stroyportal.ru/catalog/section-tsement-154/", // сервер (хост)
        , // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        , // таймаут в секундах, 0 или пусто - не устанавливать
		Новый ЗащищенноеСоединениеOpenSSL()
    );
 
	Запрос = Новый HTTPЗапрос();
	Запрос.Заголовки.Вставить("accept","*/*");
	Запрос.Заголовки.Вставить("user-agent","Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/74.0.3729.169 Safari/537.36");
	Результат = Соединение.Получить(Запрос);
	Страница=Результат.ПолучитьТелоКакСтроку();
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(Страница);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML   = ПостроительDOM.Прочитать(ЧтениеHTML);
	ЭлементыDOM    =  ДокументHTML.ПолучитьЭлементыПоИмени("DIV");
	Для Каждого ЭлементDOM Из ЭлементыDOM Цикл
		Если ЭлементDOM.ИмяКласса = "catalog_list_item_text" Тогда
			БлокТовара=ЭлементDOM.ПолучитьЭлементыПоИмени("A");
				Для Каждого Товар Из БлокТовара Цикл
					//Если Товар.ИмяКласса = "link-title" Тогда
						Сообщить(Товар.ПервыйДочерний.ТекстовоеСодержимое);
					//КонецЕсли;
				КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Ответ сервера: " + Результат.КодСостояния);
	//Сообщить("Тело результата: " + Страница);
	КонецПроцедуры
