// обрабатка файла через ком

HTML=Новый COMОбъект("HTMLFile");
    HTML.Open("C:\Loading.html");
 
    Текст = Новый ТекстовыйДокумент;
    Текст.Прочитать("C:\Loading.html");
    HTML.Write(Текст.ПолучитьТекст());
    HTMLDocument = HTML.documentElement.document;
        
    Table = HTMLDocument.getelementsbyclassname("doc-view");
    
    Для каждого Match из Table Цикл
        Сообщить(Table);
	КонецЦикла;
	
	ЧтениеHTML     = Новый ЧтениеHTML;
    ЧтениеHTML.ОткрытьФайл("D:\4.html","UTF-8");
    ПостроительDOM = Новый ПостроительDOM;
    ДокументHTML   = ПостроительDOM.Прочитать(ЧтениеHTML);
    
    ЭлементыDOM    =  ДокументHTML.ПолучитьЭлементыПоИмени("DIV");
    
    Для Каждого ЭлементDOM Из ЭлементыDOM Цикл
        Если ЭлементDOM.ИмяКласса = "doc-view" Тогда
            Сообщить(ЭлементDOM);
        КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементDOM Из ЭлементыDOM Цикл
        Если ЭлементDOM.ИмяКласса = "doc-view" Тогда
            Если ЭлементDOM.ЕстьДочерниеУзлы() Тогда
                ЭлементDOM.ЗначениеУзла
            КонецЕсли;
            Сообщить(ЭлементDOM.ТекстовоеСодержимое);
        КонецЕсли;
КонецЦикла;

HTML=Новый COMОбъект("HTMLFile");
    HTML.Open("D:\timer_example.html");

    Текст = Новый ЧтениеТекста("D:\timer_example.html", КодировкаТекста.UTF8);
    HTML.Write(Текст.Прочитать());
    Текст.Закрыть();
    HTMLDocument = HTML.documentElement.document;

    Table = HTMLDocument.getElementsByTagName("div");
    Для каждого Match из Table Цикл
        Сообщить(Match.InnerHTML);
	КонецЦикла;
	
Процедура ЗаполнитьДанные(ДокументHTML, ТаблицаДанных)
    ТекГруппа = "";
		ЭлементыDOM = ДокументHTML.ПолучитьЭлементыПоИмени("td");
			Для Каждого Элемент Из ЭлементыDOM Цикл
					Если Элемент.ИмяКласса = "groupColumn" Тогда
							ИндексКолонки = 1;
							ТекГруппа = СокрЛП(Элемент.ТекстовоеСодержимое);
				
				Продолжить;
				
			КонецЕсли;
			
			Если Элемент.ИмяКласса = "nameColumn" Тогда
				
				НоваяСтрока = ТаблицаДанных.Добавить();
				
				НоваяСтрока.Группа = ТекГруппа;
				НоваяСтрока.Название = СокрЛП(Элемент.ТекстовоеСодержимое);
				
				Если ТипЗнч(Элемент.ДочерниеУзлы[0]) = Тип("ЭлементЯкорьHTML") Тогда
					НоваяСтрока.Гиперcсылка = СокрЛП(Элемент.ДочерниеУзлы[0].Гиперссылка);
				КонецЕсли;    
											
				ИндексКолонки = 3;
				
				Продолжить;
				
			КонецЕсли;    
			
			ИндексКолонки = ИндексКолонки + 1;
			НоваяСтрока[ТаблицаДанных.Колонки[ИндексКолонки].Имя] = СокрЛП(Элемент.ТекстовоеСодержимое);
			
		КонецЦикла;    
			
	КонецПроцедуры

